<a href="https://colab.research.google.com/github/Kaue557/Analise-de-Dados/blob/main/Imersao_Dados_Alura.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# AULA **1**

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")

In [4]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  object
 2   employment_type     133349 non-null  object
 3   job_title           133349 non-null  object
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  object
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  object
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  object
 10  company_size        133349 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 11.2+ MB

In [6]:
df.describe()

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

In [7]:
df.shape # linhas/colunas

(133349, 11)

In [8]:
linhas, colunas = df.shape[0], df.shape[1] #deixando bunitin
print("linhas:", linhas, "/ colunas:", colunas)

linhas: 133349 / colunas: 11

In [9]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [10]:
column_translations = {
    'work_year': 'ano_trabalho',
    'experience_level': 'nivel_experiencia',
    'employment_type': 'tipo_emprego',
    'job_title': 'titulo_cargo',
    'salary': 'salario',
    'salary_currency': 'moeda_salario',
    'salary_in_usd': 'salario_em_usd',
    'employee_residence': 'residencia_empregado',
    'remote_ratio': 'taxa_remoto',
    'company_location': 'local_empresa',
    'company_size': 'tamanho_empresa'
}

df = df.rename(columns=column_translations)
display(df.head())

,ano_trabalho,nivel_experiencia,tipo_emprego,titulo_cargo,salario,moeda_salario,salario_em_usd,residencia_empregado,taxa_remoto,local_empresa,tamanho_empresa
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [11]:
df["nivel_experiencia"].value_counts()

nivel_experiencia
SE    77241
MI    40465
EN    12443
EX     3200
Name: count, dtype: int64

In [12]:
df["tipo_emprego"].value_counts()

tipo_emprego
FT    132563
CT       394
PT       376
FL        16
Name: count, dtype: int64

In [13]:
df["taxa_remoto"].value_counts() # 0 = presencial / 100 = remoto / 50 = hibrido

taxa_remoto
0      105312
100     27718
50        319
Name: count, dtype: int64

In [14]:
taxa_remoto = {
    0: 'Presencial',
    50: 'Híbrido',
    100: 'Remoto'
}

df['taxa_remoto'] = df['taxa_remoto'].replace(taxa_remoto)
display(df['taxa_remoto'].value_counts())

taxa_remoto
Presencial    105312
Remoto         27718
Híbrido          319
Name: count, dtype: int64

In [15]:
nivel_experiencia = {
    'SE': 'Senior',
    'MI': 'Intermediario',
    'EN': 'Junior',
    'EX': 'Executivo'
}

df['nivel_experiencia'] = df['nivel_experiencia'].replace(nivel_experiencia)
display(df['nivel_experiencia'].value_counts())

nivel_experiencia
Senior           77241
Intermediario    40465
Junior           12443
Executivo         3200
Name: count, dtype: int64

In [16]:
tipo_emprego = {
    'FT': 'Tempo Integral',
    'CT': 'Contrato',
    'PT': 'Meio Período',
    'FL': 'Freelancer'
}

df['tipo_emprego'] = df['tipo_emprego'].replace(tipo_emprego)
display(df['tipo_emprego'].value_counts())

tipo_emprego
Tempo Integral    132563
Contrato             394
Meio Período         376
Freelancer            16
Name: count, dtype: int64

In [17]:
df["tamanho_empresa"].value_counts()

tamanho_empresa
M    129561
L      3574
S       214
Name: count, dtype: int64

In [18]:
df.head()

,ano_trabalho,nivel_experiencia,tipo_emprego,titulo_cargo,salario,moeda_salario,salario_em_usd,residencia_empregado,taxa_remoto,local_empresa,tamanho_empresa
0,2025.0,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,M
1,2025.0,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,M
2,2025.0,Intermediario,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,M
3,2025.0,Intermediario,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,M
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,M

In [19]:
df.describe(include="object")

,nivel_experiencia,tipo_emprego,titulo_cargo,moeda_salario,residencia_empregado,taxa_remoto,local_empresa,tamanho_empresa
count,133349,133349,133349,133349,133349,133349,133349,133349
unique,4,4,390,26,102,3,95,3
top,Senior,Tempo Integral,Data Scientist,USD,US,Presencial,US,M
freq,77241,132563,17314,126140,119579,105312,119641,129561

# AULA **2**

In [23]:
df.isnull().value_counts()

ano_trabalho  nivel_experiencia  tipo_emprego  titulo_cargo  salario  moeda_salario  salario_em_usd  residencia_empregado  taxa_remoto  local_empresa  tamanho_empresa
False         False              False         False         False    False          False           False                 False        False          False              133339
True          False              False         False         False    False          False           False                 False        False          False                  10
Name: count, dtype: int64

In [24]:
df.isnull().sum()

ano_trabalho            10
nivel_experiencia        0
tipo_emprego             0
titulo_cargo             0
salario                  0
moeda_salario            0
salario_em_usd           0
residencia_empregado     0
taxa_remoto              0
local_empresa            0
tamanho_empresa          0
dtype: int64

In [29]:
df['ano_trabalho'].unique()

array([2025.,   nan, 2024., 2022., 2023., 2020., 2021.])

In [ ]:
df[df.isnull().any(axis=1)]

In [ ]:
import numpy as np

df_salarios = pd.DataFrame({
    "nome" : ["Ana", "Bruno", "Carlos", "Daniele", "Val"],
    "salario" : [4000, np.nan, 5000, np.nan, 100000]
})

# calcula media e substitui nulos + arredondamento
df_salarios["salario_media"] = df_salarios["salario"].fillna(df_salarios["salario"].mean().round(2))
df_salarios

# calcula mediana e substitui nulos
df_salarios["salario_mediana"] = df_salarios["salario"].fillna(df_salarios["salario"].median())
df_salarios

In [ ]:
df_temperaturas = pd.DataFrame({
    "Dia" : ["Segunda", "Terca", "Quarta", "Quinta", "Sexta"],
    "Temperatura" : [30, np.nan, np.nan, 28, 27]
})

df_temperaturas["Preenchido_ffill"] = df_temperaturas["Temperatura"].ffill()
df_temperaturas

In [ ]:
df_temperaturas = pd.DataFrame({
    "Dia" : ["Segunda", "Terca", "Quarta", "Quinta", "Sexta"],
    "Temperatura" : [30, np.nan, np.nan, 28, 27]
})

df_temperaturas["Preenchido_bfill"] = df_temperaturas["Temperatura"].bfill()
df_temperaturas

In [46]:
df_limpo = df.dropna()

In [ ]:
df_limpo.isnull().sum()

In [60]:
df_limpo.head()

,ano_trabalho,nivel_experiencia,tipo_emprego,titulo_cargo,salario,moeda_salario,salario_em_usd,residencia_empregado,taxa_remoto,local_empresa,tamanho_empresa,ano
0,2025,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,M,2025
1,2025,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,M,2025
2,2025,Intermediario,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,M,2025
3,2025,Intermediario,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,M,2025
4,2025,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,M,2025

In [61]:
df_limpo.info()

<class 'pandas.core.frame.DataFrame'>
Index: 133339 entries, 0 to 133348
Data columns (total 12 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   ano_trabalho          133339 non-null  Int64
 1   nivel_experiencia     133339 non-null  object
 2   tipo_emprego          133339 non-null  object
 3   titulo_cargo          133339 non-null  object
 4   salario               133339 non-null  int64
 5   moeda_salario         133339 non-null  object
 6   salario_em_usd        133339 non-null  int64
 7   residencia_empregado  133339 non-null  object
 8   taxa_remoto           133339 non-null  object
 9   local_empresa         133339 non-null  object
 10  tamanho_empresa       133339 non-null  object
 11  ano                   133339 non-null  Int64
dtypes: Int64(2), int64(2), object(8)
memory usage: 13.5+ MB

In [59]:
df_limpo = df_limpo.assign(ano_trabalho = df_limpo['ano_trabalho'].astype('Int64'))